package com.hongye.engineering.update.common;

/**
 * ClassName:BizCodeEnum <br/>
 * Function: 业务状态enum类. <br/>
 * Date: 2018年2月1日 上午11:00:00 <br/>
 * 
 * @author dell
 * @version
 * @since JDK 1.8
 * @see
 */
public enum BizCodeEnum {

    /**
     * 获取数据成功
     */
	B2B2000("2000", "获取数据成功"),
	/**
	 * 添加成功
	 */
	B2B2001("2001", "添加成功"),
	/**
	 * 更新成功
	 */
	B2B2002("2002", "更新成功"),
	/**
	 * 删除成功
	 */
	B2B2003("2003", "删除成功"),
	/**
	 * 系统错误
	 */
	B2B5000("5000", "系统错误"), 
	/**
	 * copy对象错误
	 */
    B2B4001("4001", "copy对象错误"),
	/**
     * 参数为空
     */
    B2B4002("4002", "参数为空"),
    /**
     * 授权码为空
     */
    B2B4003("4003", "授权码为空"),
    /**
     * 企业logo为空
     */
    B2B4004("4004", "企业logo为空"),
    /**
     * 企业名称为空
     */
    B2B4005("4005", "企业名称为空"),
    /**
     * 联系电话为空
     */
    B2B4006("4006", "联系电话为空"),
    /**
     * 项目名称为空
     */
    B2B4007("4007", "项目名称为空"),
    /**
     * 项目图片为空
     */
    B2B4008("4008", "项目图片为空"),
    /**
     * 负责人为空
     */
    B2B4009("4009", "负责人为空"),
    /**
     * 项目密码为空
     */
    B2B4010("4010", "项目密码为空"),
    /**
     * 项目规模为空
     */
    B2B4011("4011", "项目规模为空"),
    /**
     * 用户名称为空
     */
    B2B4012("4012", "用户名称为空"),
    /**
     * 创建人为空
     */
    B2B4013("4013", "创建人为空"),
    /**
     * 用户手机号为空
     */
    B2B4014("4014", "用户手机号为空"),
    /**
     * 是否管理员为空
     */
    B2B4015("4015", "是否管理员为空"),
    /**
     * 用户id为空
     */
    B2B4016("4016", "用户id为空"),
    /**
     * 修改人为空
     */
    B2B4017("4017", "修改人为空"),
    /**
     * 项目id为空
     */
    B2B4018("4018", "项目id为空"),
    /**
     * 区域名称为空
     */
    B2B4019("4019", "区域名称为空"),
    /**
     * 区域图片为空
     */
    B2B4020("4020", "区域图片为空"),
    /**
     * 区域id为空
     */
    B2B4021("4021", "区域id为空"),
    /**
     * 用户为空
     */
    B2B4022("4022", "用户为空"),
    /**
     * 区域为空
     */
    B2B4023("4023", "区域为空"),
    /**
     * 菜单名称为空
     */
    B2B4024("4024", "菜单名称为空"),
    /**
     * 菜单id为空
     */
    B2B4025("4025", "菜单id为空"),
    /**
     * 项目不存在
     */
    B2B4026("4026", "项目不存在"),
    /**
     * 项目密码不正确
     */
    B2B4027("4027", "项目密码不正确"),
    /**
     * 用户不存在
     */
    B2B4028("4028", "用户不存在"),
    /**
     * 文件id为空
     */
    B2B4029("4029", "文件id为空"),
    /**
     * 版本号为空
     */
    B2B4030("4030", "版本号为空"),
    /**
     * 区域版本id为空
     */
    B2B4031("4031", "区域版本id为空"),
    /**
     * 版本添加异常
     */
    B2B4032("4032", "版本添加异常"),
    /**
     * 构件类别id为空
     */
    B2B4033("4033", "构件类别id为空"),
    /**
     * 资料类别名称为空
     */
    B2B4034("4034", "资料类别名称为空"),
    /**
     * 构件资料类别id为空
     */
    B2B4035("4035", "构件资料类别id为空"),
    /**
     * 文件信息为空
     */
    B2B4036("4036", "文件信息为空"),
    /**
     * 菜单版本id为空
     */
    B2B4037("4037", "菜单版本id为空"),
    /**
     * 文件已存在
     */
    B2B4038("4038", "文件已存在"),
    /**
     * oss工作台名称为空
     */
    B2B4039("4039", "oss工作台名称为空"),
    /**
     * oss mini 文件keyId为空
     */
    B2B4040("4040", "oss mini 文件keyId为空"),
    /**
     * oss mini 文件名称为空
     */
    B2B4041("4041", "oss mini 文件名称为空"),
    /**
     * 菜单没有生成，请先设置菜单
     */
    B2B4042("4042", "菜单没有生成，请先设置菜单"),
    /**
     * 新建项目模型拆分新建任务错误
     */
    B2B4043("4043", "新建项目模型拆分新建任务错误"),
    /**
     * 模型轻量化信息为空
     */
    B2B4044("4044", "模型轻量化信息为空"),
    /**
     * 文件类型为空
     */
    B2B4045("4045", "文件类型为空"),
    /**
     * 模型id为空
     */
    B2B4046("4046", "模型id为空"),
    /**
     * 构件属性id为空
     */
    B2B4047("4047", "构件属性id为空"),
    /**
     * 构件id为空
     */
    B2B4048("4048", "构件id为空"),
    /**
     * 是否显示为空
     */
    B2B4049("4049", "是否显示为空"),
    /**
     * encode或decode错误
     */
    B2B4050("4050", "encode或decode错误"),
    /**
     * 字符串生成图片错误
     */
    B2B4051("4051", "字符串生成图片错误"),
    /**
     * 生成文件流错误
     */
    B2B4052("4052", "生成文件流错误"),
    /**
     * 压缩文件错误
     */
    B2B4053("4053", "压缩文件错误"),
    /**
     * 解压缩文件错误
     */
    B2B4054("4054", "解压缩文件错误"),
    /**
     * 无效授权码
     */
    B2B4055("4055", "无效授权码"),
    /**
     * 用户手机号已存在
     */
    B2B4056("4056", "用户手机号已存在"),
    /**
     * 模型版本为空
     */
    B2B4057("4057", "模型版本为空"),
    /**
     * 该模型轻量化没有完成，请完成后在发布
     */
    B2B4058("4058", "该模型轻量化没有完成，请完成后在发布"),
    /**
     * 授权码绑定项目信息失败
     */
    B2B4059("4059", "授权码绑定项目信息失败"),
    /**
     * 平台用户与项目绑定失败
     */
    B2B4060("4060", "平台用户与项目绑定失败"),
    /**
     * 授权码激活项目失败
     */
    B2B4061("4061", "授权码激活项目失败"),
    /**
     * 获取本地服务ip地址失败
     */
    B2B4062("4062", "获取本地服务ip地址失败"),
    /**
     * 授权码不存在
     */
    B2B4063("4063", "授权码不存在"),
    /**
     * 授权码已使用
     */
    B2B4064("4064", "授权码已使用"),
    /**
     * 项目人员已达到上限，请联系010-64753121
     */
    B2B4065("4065", "项目人员已达到上限，请联系010-64753121"),
    /**
     * 项目模型已达到上限，请联系010-64753121
     */
    B2B4066("4066", "项目模型已达到上限，请联系010-64753121"),
    /**
     * 区域版本发布组离线数据包失败
     */
    B2B4067("4067", "区域版本发布组离线数据包失败"),
    
    /**
     * 版本更新失败
     */
    B2B4068("4068", "版本更新失败"),

	;
	private BizCodeEnum(String value, String msg) {
		this.value = value;
		this.msg = msg;
	}

	private String value;

	private String msg;

	public String getValue() {
		return value;
	}

	public void setValue(String value) {
		this.value = value;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}

}